; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v6 ?v5)
             (pred_7 ?v3 ?v7)
             (pred_11 ?v6 ?v7)
             (pred_5 ?v12 ?v6 )
	     (pred_10 ?v6)
             (pred_1 ?v9)
             (pred_3 ?v3)
             (pred_9 ?v7)
             (pred_8 ?v6)
             (pred_2 ?v3)
             (pred_4 ?v6)
             (pred_12 ))



(:action op_4
:parameters (?v11 ?v1 ?v8 ?v4)
:precondition (and (pred_1 ?v11) (pred_1 ?v1) (pred_3 ?v8) (pred_9 ?v4)
          (pred_6 ?v11 ?v1) (pred_7 ?v8 ?v4)
                   (pred_11 ?v1 ?v4) (pred_10 ?v11) 
                   (pred_8 ?v1) (pred_2 ?v8))
:effect (and  (pred_4 ?v1) (not (pred_8 ?v1))))


(:action op_1
:parameters (?v11 ?v10)
:precondition (and (pred_1 ?v11) (pred_1 ?v10)
               (pred_10 ?v11) (pred_6 ?v11 ?v10) (pred_4 ?v10))
:effect (and (pred_10 ?v10) (not (pred_10 ?v11))))

(:action op_2
:parameters (?v11 ?v8)
:precondition (and (pred_1 ?v11) (pred_3 ?v8) 
                  (pred_10 ?v11) (pred_5 ?v8 ?v11) (pred_12 ))
:effect (and (pred_2 ?v8)
   (not (pred_5 ?v8 ?v11)) (not (pred_12 ))))


(:action op_5
:parameters (?v11 ?v13 ?v2)
:precondition (and (pred_1 ?v11) (pred_3 ?v13) (pred_3 ?v2)
                  (pred_10 ?v11) (pred_2 ?v2) (pred_5 ?v13 ?v11))
:effect (and (pred_2 ?v13) (pred_5 ?v2 ?v11)
        (not (pred_2 ?v2)) (not (pred_5 ?v13 ?v11))))

(:action op_3
:parameters (?v11 ?v8)
:precondition (and (pred_1 ?v11) (pred_3 ?v8) 
                  (pred_10 ?v11) (pred_2 ?v8))
:effect (and (pred_12 ) (pred_5 ?v8 ?v11) (not (pred_2 ?v8)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_24 obj_01 obj_25 obj_16 obj_03 obj_17 obj_10 obj_09 obj_11 obj_13 obj_08 obj_31 obj_28 obj_15 obj_20 obj_18 obj_02 obj_12 obj_04 obj_05 obj_27 obj_26 obj_19 obj_22 obj_21
    obj_14 obj_07 obj_30
    obj_06 obj_23 obj_29
    )

    (:init
       (pred_12)

       (pred_1 obj_24)
       (pred_1 obj_01)
       (pred_1 obj_25)
       (pred_1 obj_16)
       (pred_1 obj_03)
       (pred_1 obj_17)
       (pred_1 obj_10)
       (pred_1 obj_09)
       (pred_1 obj_11)
       (pred_1 obj_13)
       (pred_1 obj_08)
       (pred_1 obj_31)
       (pred_1 obj_28)
       (pred_1 obj_15)
       (pred_1 obj_20)
       (pred_1 obj_18)
       (pred_1 obj_02)
       (pred_1 obj_12)
       (pred_1 obj_04)
       (pred_1 obj_05)
       (pred_1 obj_27)
       (pred_1 obj_26)
       (pred_1 obj_19)
       (pred_1 obj_22)
       (pred_1 obj_21)
       (pred_9 obj_14)
       (pred_9 obj_07)
       (pred_9 obj_30)
       (pred_3 obj_06)
       (pred_3 obj_23)
       (pred_3 obj_29)

       (pred_6 obj_24 obj_17)
       (pred_6 obj_24 obj_01)
       (pred_6 obj_01 obj_10)
       (pred_6 obj_01 obj_25)
       (pred_6 obj_01 obj_24)
       (pred_6 obj_25 obj_09)
       (pred_6 obj_25 obj_16)
       (pred_6 obj_25 obj_01)
       (pred_6 obj_16 obj_11)
       (pred_6 obj_16 obj_03)
       (pred_6 obj_16 obj_25)
       (pred_6 obj_03 obj_13)
       (pred_6 obj_03 obj_16)
       (pred_6 obj_17 obj_08)
       (pred_6 obj_17 obj_10)
       (pred_6 obj_17 obj_24)
       (pred_6 obj_10 obj_31)
       (pred_6 obj_10 obj_09)
       (pred_6 obj_10 obj_01)
       (pred_6 obj_10 obj_17)
       (pred_6 obj_09 obj_28)
       (pred_6 obj_09 obj_11)
       (pred_6 obj_09 obj_25)
       (pred_6 obj_09 obj_10)
       (pred_6 obj_11 obj_15)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_11 obj_16)
       (pred_6 obj_11 obj_09)
       (pred_6 obj_13 obj_20)
       (pred_6 obj_13 obj_03)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_08 obj_18)
       (pred_6 obj_08 obj_31)
       (pred_6 obj_08 obj_17)
       (pred_6 obj_31 obj_02)
       (pred_6 obj_31 obj_28)
       (pred_6 obj_31 obj_10)
       (pred_6 obj_31 obj_08)
       (pred_6 obj_28 obj_12)
       (pred_6 obj_28 obj_15)
       (pred_6 obj_28 obj_09)
       (pred_6 obj_28 obj_31)
       (pred_6 obj_15 obj_04)
       (pred_6 obj_15 obj_20)
       (pred_6 obj_15 obj_11)
       (pred_6 obj_15 obj_28)
       (pred_6 obj_20 obj_05)
       (pred_6 obj_20 obj_13)
       (pred_6 obj_20 obj_15)
       (pred_6 obj_18 obj_27)
       (pred_6 obj_18 obj_02)
       (pred_6 obj_18 obj_08)
       (pred_6 obj_02 obj_26)
       (pred_6 obj_02 obj_12)
       (pred_6 obj_02 obj_31)
       (pred_6 obj_02 obj_18)
       (pred_6 obj_12 obj_19)
       (pred_6 obj_12 obj_04)
       (pred_6 obj_12 obj_28)
       (pred_6 obj_12 obj_02)
       (pred_6 obj_04 obj_22)
       (pred_6 obj_04 obj_05)
       (pred_6 obj_04 obj_15)
       (pred_6 obj_04 obj_12)
       (pred_6 obj_05 obj_21)
       (pred_6 obj_05 obj_20)
       (pred_6 obj_05 obj_04)
       (pred_6 obj_27 obj_26)
       (pred_6 obj_27 obj_18)
       (pred_6 obj_26 obj_19)
       (pred_6 obj_26 obj_02)
       (pred_6 obj_26 obj_27)
       (pred_6 obj_19 obj_22)
       (pred_6 obj_19 obj_12)
       (pred_6 obj_19 obj_26)
       (pred_6 obj_22 obj_21)
       (pred_6 obj_22 obj_04)
       (pred_6 obj_22 obj_19)
       (pred_6 obj_21 obj_05)
       (pred_6 obj_21 obj_22)
       (pred_8 obj_09)
       (pred_8 obj_19)
       (pred_8 obj_15)
       (pred_11  obj_09 obj_14)
       (pred_11  obj_19 obj_07)
       (pred_11  obj_15 obj_30)
       (pred_4 obj_24)
       (pred_4 obj_01)
       (pred_4 obj_25)
       (pred_4 obj_16)
       (pred_4 obj_03)
       (pred_4 obj_17)
       (pred_4 obj_10)
       (pred_4 obj_11)
       (pred_4 obj_13)
       (pred_4 obj_08)
       (pred_4 obj_31)
       (pred_4 obj_28)
       (pred_4 obj_20)
       (pred_4 obj_18)
       (pred_4 obj_02)
       (pred_4 obj_12)
       (pred_4 obj_04)
       (pred_4 obj_05)
       (pred_4 obj_27)
       (pred_4 obj_26)
       (pred_4 obj_22)
       (pred_4 obj_21)

       (pred_7  obj_06 obj_14)
       (pred_7  obj_23 obj_07)
       (pred_7  obj_29 obj_30)
       (pred_5 obj_06 obj_03)
       (pred_5 obj_23 obj_25)
       (pred_5 obj_29 obj_31)
       (pred_10 obj_08)
    )

    (:goal (and
       (pred_5 obj_23 obj_08)
       (pred_5 obj_29 obj_08)
    ))
(:constraints
  (always (not (pred_10 obj_17)))
)
)

; plan
1. (op_1 obj_08 obj_31)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_31)
   goals met: 0 of 2
2. (op_2 obj_31 obj_29)
   deleted: (pred_5 obj_29 obj_31) (pred_12)
   added: (pred_2 obj_29)
   goals met: 0 of 2
3. (op_1 obj_31 obj_08)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_08)
   goals met: 0 of 2
4. (op_3 obj_08 obj_29)
   deleted: (pred_2 obj_29)
   added: (pred_12) (pred_5 obj_29 obj_08)
   goals met: 1 of 2
5. (op_1 obj_08 obj_31)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_31)
   goals met: 1 of 2
6. (op_1 obj_31 obj_10)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_10)
   goals met: 1 of 2
7. (op_1 obj_10 obj_01)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_01)
   goals met: 1 of 2
8. (op_1 obj_01 obj_25)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_25)
   goals met: 1 of 2
9. (op_2 obj_25 obj_23)
   deleted: (pred_5 obj_23 obj_25) (pred_12)
   added: (pred_2 obj_23)
   goals met: 1 of 2
10. (op_1 obj_25 obj_01)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_01)
   goals met: 1 of 2
11. (op_1 obj_01 obj_10)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_10)
   goals met: 1 of 2
12. (op_1 obj_10 obj_31)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_31)
   goals met: 1 of 2
13. (op_1 obj_31 obj_08)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_08)
   goals met: 1 of 2
14. (op_3 obj_08 obj_23)
   deleted: (pred_2 obj_23)
   added: (pred_12) (pred_5 obj_23 obj_08)
   goals met: 2 of 2
